### Pandas - DataFrames and Series

In [1]:
import pandas as pd

In [8]:
## Series -> one dimension like array can hold any data type
data = [1,2,3,4,5,6]
series = pd.Series(data)
print("Sereis : ",series)
print(type(series))

Sereis :  0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data = [1,2,3,4]
index = ['a','b','c','d']
print(pd.Series(data,index = index))

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
## Data Frame
## Create a DataFrame from a Dictionary of list
data  = {
    'Name' : ["Kishore","Murugan","Shiva"],
    'Age' : [23,24,54],
    'City' : ["Chennai","Palani","Nalgonda"]
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0  Kishore   23   Chennai
1  Murugan   24    Palani
2    Shiva   54  Nalgonda
<class 'pandas.core.frame.DataFrame'>

In [ ]:
## Create a Data Frame from list of Dictionary
lst = [
    {'Name' : "Murugan",'Age' : 33, 'City' :"Hyderabad"},
    {'Name' : "kishore",'Age' : 23, 'City' :"Banglore"},
    {'Name' : "Shiva",'Age' : 43, 'City' :"New York"},
    {'Name' : "Krish",'Age' : 53, 'City' :"Florida"},
]
df = pd.DataFrame(lst)
print(df)

      Name  Age      City
0  Murugan   33  Nalgonda
1  kishore   23  Nalgonda
2    Shiva   43  Nalgonda
3    Krish   53  Nalgonda

In [15]:
df = pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [16]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [17]:
data = [
    {'Name' : "Murugan",'Age' : 33, 'City' :"Hyderabad"},
    {'Name' : "kishore",'Age' : 23, 'City' :"Banglore"},
    {'Name' : "Shiva",'Age' : 43, 'City' :"New York"},
    {'Name' : "Krish",'Age' : 53, 'City' :"Florida"},
]
df = pd.DataFrame(data)

In [18]:
df

      Name  Age       City
0  Murugan   33  Hyderabad
1  kishore   23   Banglore
2    Shiva   43   New York
3    Krish   53    Florida

In [ ]:
df['Name']

0    Murugan
1    kishore
2      Shiva
3      Krish
Name: Name, dtype: object

In [20]:
type(df['Name'])

pandas.core.series.Series

In [ ]:
df.loc[0] # am going to just pick up 0th row -> for only row index

Name      Murugan
Age            33
City    Hyderabad
Name: 0, dtype: object

In [ ]:
df.iloc[0] # am going to just pickup 0th column

Name      Murugan
Age            33
City    Hyderabad
Name: 0, dtype: object

In [23]:
df.iloc[0][0]

C:\Users\kisho\AppData\Local\Temp\ipykernel_117400\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Murugan'

In [30]:
## Accessing specified Element
df.at[1,'Age']

np.int64(23)

In [29]:
df.at[2,'Name']

'Shiva'

In [32]:
## Accessing specified Element using iat
df.iat[2,2] #We have to give both row index and column index

'New York'

In [33]:
## Data Manipulation with Data Frames
df

      Name  Age       City
0  Murugan   33  Hyderabad
1  kishore   23   Banglore
2    Shiva   43   New York
3    Krish   53    Florida

In [34]:
df['Salary'] = [50000,60000,70000,80000]

In [35]:
df

      Name  Age       City  Salary
0  Murugan   33  Hyderabad   50000
1  kishore   23   Banglore   60000
2    Shiva   43   New York   70000
3    Krish   53    Florida   80000

In [ ]:
## Remove Column
df.drop('Salary',axis=0)

KeyError: "['Salary'] not found in axis"

In [ ]:
df.drop('Salary',axis=1) # Not a Permenet operation

      Name  Age       City
0  Murugan   33  Hyderabad
1  kishore   23   Banglore
2    Shiva   43   New York
3    Krish   53    Florida

In [38]:
df

      Name  Age       City  Salary
0  Murugan   33  Hyderabad   50000
1  kishore   23   Banglore   60000
2    Shiva   43   New York   70000
3    Krish   53    Florida   80000

In [39]:
# Permenet operation 
df.drop('Salary',axis=1,inplace=True)

In [40]:
df

      Name  Age       City
0  Murugan   33  Hyderabad
1  kishore   23   Banglore
2    Shiva   43   New York
3    Krish   53    Florida

In [41]:
df['Age'] =df['Age']+1

In [42]:
df

      Name  Age       City
0  Murugan   34  Hyderabad
1  kishore   24   Banglore
2    Shiva   44   New York
3    Krish   54    Florida

In [ ]:
## Drop pertuclar row
df.drop(0) # Not Permenent

      Name  Age      City
1  kishore   24  Banglore
2    Shiva   44  New York
3    Krish   54   Florida

In [44]:
df

      Name  Age       City
0  Murugan   34  Hyderabad
1  kishore   24   Banglore
2    Shiva   44   New York
3    Krish   54    Florida

In [45]:
df.drop(0,inplace=True)

In [47]:
df

      Name  Age      City
1  kishore   24  Banglore
2    Shiva   44  New York
3    Krish   54   Florida

In [48]:
df = pd.read_csv('sales_data.csv')
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000